app/admin/categories.rb

    id_column
    column :name
    column :solar_contents_count do |category|
      category.solar_contents.count
---
SELECT COUNT(*) FROM "solar_contents" WHERE "solar_contents"."category_id" = ?  [["category_id", 2]]