app/admin/dashboard.rb

SELECT COUNT(*) FROM "solar_users"
SELECT COUNT(*) FROM "solar_companies"
---
      column do
        panel "Estatísticas Gerais" do
          ul do
            li "Usuários: #{SolarUser.count}"
            li "Empresas Solares: #{SolarCompany.count}"