app/admin/dashboard.rb

SELECT "solar_companies".* FROM "solar_companies" WHERE "solar_companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  menu priority: 1, label: "Company Dashboard"

  content do
    company = SolarCompany.find_by(id: 1) # Assuming you want to display details for a specific company, e.g., ID 1

SELECT COUNT(*) FROM "solar_reviews"
SELECT "solar_reviews".* FROM "solar_reviews" ORDER BY "solar_reviews"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
---
          render partial: "metrics", locals: { company: company }
        end
        tab :reviews do
          render partial: "reviews", locals: { reviews: company.solar_reviews.limit(5) }