app/admin/saas_access_management.rb

SELECT "solar_users".* FROM "solar_users"
---
    actions
  end

  filter :user_id, as: :select, collection: -> { SolarUser.all.map { |u| [u.email, u.id] } }

SELECT "solar_users".* FROM "solar_users"
---

  form do |f|
    f.inputs do
      f.input :user_id, as: :select, collection: -> { SolarUser.all.map { |u| [u.name, u.id] } }