app/admin/solar_companies.rb

  filter :installed_capacity_mwp
  filter :avg_rating
  filter :reviews_count
  filter :created_by_id, as: :select, collection: -> { SolarUser.all.map { |u| [u.email, u.id] } }
---
SELECT "solar_users".* FROM "solar_users"