app/admin/solar_users.rb

    def scoped_collection
      if current_admin_user && current_admin_user.solar_user&.role == 'admin'
        super
      else
        super.where(role: 'user')
      end
    end
  end
  form do |f|
    f.inputs do
      f.input :email
      f.input :name
      f.input :role, as: :select, collection: SolarUser.roles.keys
      f.input :created_by_id, as: :select, collection: SolarUser.all.map { |su| [su.email, su.id] }
---
SELECT "solar_users".* FROM "solar_users"