app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published_at" IS NOT NULL ORDER BY "posts"."published_at" DESC
---
  def index
    # @posts = Post.all.order(created_at: :desc)
    @posts = Post.where.not(published_at: nil).order(published_at: :desc)